<a href="https://colab.research.google.com/github/Cllasd44/Inteligencia-Artificiial/blob/main/Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
series=pd.Series(data=[1,2,3,4,5], index=['Ronald', 'Silvana', 'Tifani', 'Evelyn','Fernanda'])

In [ ]:
print(series)

Ronald      1
Silvana     2
Tifani      3
Evelyn      4
Fernanda    5
dtype: int64

In [ ]:
print(series.index)

Index(['Ronald', 'Silvana', 'Tifani', 'Evelyn', 'Fernanda'], dtype='object')

In [ ]:
'Silvana' in series

True

In [ ]:
series*2

Ronald       2
Silvana      4
Tifani       6
Evelyn       8
Fernanda    10
dtype: int64

In [ ]:
print(series)

Ronald      1
Silvana     2
Tifani      3
Evelyn      4
Fernanda    5
dtype: int64

In [ ]:
series=series*2
print(series)

Ronald       2
Silvana      4
Tifani       6
Evelyn       8
Fernanda    10
dtype: int64

In [ ]:
series[[1,3]]

<ipython-input-9-ce78a48b16cf>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  series[[1,3]]

Silvana    4
Evelyn     8
dtype: int64

In [ ]:
d={'Ronald':1,'Silvana':2,'Tifani':3,'Evelyn':4,'Fernanda':5}
#DATAFRAME
d={'one':pd.Series(data=[100,200,300], index=['apple','ball','clock']),
   'two':pd.Series(data=[111,222,333,444], index=['apple','ball','cerill','dancy'])}
df=pd.DataFrame(d)
print(df)

          one    two
apple   100.0  111.0
ball    200.0  222.0
cerill    NaN  333.0
clock   300.0    NaN
dancy     NaN  444.0

In [ ]:
df.columns

Index(['one', 'two'], dtype='object')

In [ ]:
import pandas as pd

# Datos para el DataFrame
data = {
    'Nombre': ['Ana', 'Juan', 'Laura', 'Pedro'],
    'Matematicas': [80, 75, 90, 85],
    'Ciencias': [70, 80, 75, 90],
    'Lengua': [90, 85, 80, 75]
}

# Crear el DataFrame
df = pd.DataFrame(data)

# Mostrar el DataFrame
print(df)

  Nombre  Matematicas  Ciencias  Lengua
0    Ana           80        70      90
1   Juan           75        80      85
2  Laura           90        75      80
3  Pedro           85        90      75